{
  "@node-saml/passport-saml_5.1.0": {
    "timestamp": 1763837091.6150076,
    "data": []
  },
  "aws-sdk_2.1692.0": {
    "timestamp": 1763837092.883203,
    "data": [
      {
        "cve": "CVE-2020-28472",
        "description": "This affects the package @aws-sdk/shared-ini-file-loader before 1.0.0-rc.9; the package aws-sdk before 2.814.0. If an attacker submits a malicious INI file to an application that parses it with loadSharedConfigFiles , they will pollute the prototype on the application. This can be exploited further depending on the context.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.3
      }
    ]
  },
  "aws4_1.13.2": {
    "timestamp": 1763837094.263723,
    "data": [
      {
        "cve": "CVE-2025-31161",
        "description": "CrushFTP 10 before 10.8.4 and 11 before 11.3.1 allows authentication bypass and takeover of the crushadmin account (unless a DMZ proxy instance is used), as exploited in the wild in March and April 2025, aka \"Unauthenticated HTTP(S) port access.\" A race condition exists in the AWS4-HMAC (compatible with S3) authorization method of the HTTP component of the FTP server. The server first verifies the existence of the user by performing a call to login_user_pass() with no password requirement. This will authenticate the session through the HMAC verification process and up until the server checks for user verification once more. The vulnerability can be further stabilized, eliminating the need for successfully triggering a race condition, by sending a mangled AWS4-HMAC header. By providing only the username and a following slash (/), the server will successfully find a username, which triggers the successful anypass authentication process, but the server will fail to find the expected SignedHeaders entry, resulting in an index-out-of-bounds error that stops the code from reaching the session cleanup. Together, these issues make it trivial to authenticate as any known or guessable user (e.g., crushadmin), and can lead to a full compromise of the system by obtaining an administrative account.",
        "severity": "CRITICAL",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 9.8
      }
    ]
  },
  "axios_1.13.2": {
    "timestamp": 1763837095.6736505,
    "data": [
      {
        "cve": "CVE-2018-18437",
        "description": "In AXIOS ITALIA Axioscloud Sissiweb Registro Elettronico 1.7.0, secret/relogoff.aspx has XSS via the Error_Desc parameter.",
        "severity": "MEDIUM",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 6.1
      },
      {
        "cve": "CVE-2019-7693",
        "description": "Axios Italia Axios RE 1.7.0/7.0.0 devices have XSS via the RELogOff.aspx Error_Parameters parameter. In some situations, the XSS would be on the family.axioscloud.it cloud service; however, the vendor also supports \"Sissi in Rete (con server)\" for offline operation.",
        "severity": "MEDIUM",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 6.1
      },
      {
        "cve": "CVE-2019-10742",
        "description": "Axios up to and including 0.18.0 allows attackers to cause a denial of service (application crash) by continuing to accepting content after maxContentLength is exceeded.",
        "severity": "HIGH",
        "type": "Denial of Service",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2020-28168",
        "description": "Axios NPM package 0.21.0 contains a Server-Side Request Forgery (SSRF) vulnerability where an attacker is able to bypass a proxy by providing a URL that responds with a redirect to a restricted host or IP address.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.9
      },
      {
        "cve": "CVE-2021-3749",
        "description": "axios is vulnerable to Inefficient Regular Expression Complexity",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2019-25068",
        "description": "A vulnerability classified as critical was found in Axios Italia Axios RE 1.7.0/7.0.0. This vulnerability affects unknown code of the file REDefault.aspx of the component Connection Handler. The manipulation of the argument DBIDX leads to privilege escalation. The attack can be initiated remotely.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 6.3
      },
      {
        "cve": "CVE-2019-25069",
        "description": "A vulnerability, which was classified as problematic, has been found in Axios Italia Axios RE 1.7.0/7.0.0. This issue affects some unknown processing of the component Error Message Handler. The manipulation leads to information disclosure (ASP.NET). The attack may be initiated remotely.",
        "severity": "MEDIUM",
        "type": "Information Disclosure",
        "remediation": "Update to a patched version",
        "cvss_score": 5.3
      },
      {
        "cve": "CVE-2023-45857",
        "description": "An issue discovered in Axios 1.5.1 inadvertently reveals the confidential XSRF-TOKEN stored in cookies by including it in the HTTP header X-XSRF-TOKEN for every request made to any host allowing attackers to view sensitive information.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 6.5
      },
      {
        "cve": "CVE-2024-39338",
        "description": "axios 1.7.2 allows SSRF via unexpected behavior where requests for path relative URLs get processed as protocol relative URLs.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2024-57965",
        "description": "In axios before 1.7.8, lib/helpers/isURLSameOrigin.js does not use a URL object when determining an origin, and has a potentially unwanted setAttribute('href',href) call. NOTE: some parties feel that the code change only addresses a warning message from a SAST tool and does not fix a vulnerability.",
        "severity": "NONE",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 0.0
      },
      {
        "cve": "CVE-2025-27152",
        "description": "axios is a promise based HTTP client for the browser and node.js. The issue occurs when passing absolute URLs rather than protocol-relative URLs to axios. Even if ⁠baseURL is set, axios sends the request to the specified absolute URL, potentially causing SSRF and credential leakage. This issue impacts both server-side and client-side usage of axios. This issue is fixed in 1.8.2.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2025-58754",
        "description": "Axios is a promise based HTTP client for the browser and Node.js. When Axios prior to versions 0.30.2 and 1.12.0 runs on Node.js and is given a URL with the `data:` scheme, it does not perform HTTP. Instead, its Node http adapter decodes the entire payload into memory (`Buffer`/`Blob`) and returns a synthetic 200 response. This path ignores `maxContentLength` / `maxBodyLength` (which only protect HTTP responses), so an attacker can supply a very large `data:` URI and cause the process to allocate unbounded memory and crash (DoS), even if the caller requested `responseType: 'stream'`. Versions 0.30.2 and 1.12.0 contain a patch for the issue.",
        "severity": "HIGH",
        "type": "Denial of Service",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      }
    ]
  },
  "body-parser_2.2.0": {
    "timestamp": 1763837097.1085606,
    "data": [
      {
        "cve": "CVE-2021-3666",
        "description": "body-parser-xml is vulnerable to Improperly Controlled Modification of Object Prototype Attributes ('Prototype Pollution')",
        "severity": "CRITICAL",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 9.8
      },
      {
        "cve": "CVE-2024-45590",
        "description": "body-parser is Node.js body parsing middleware. body-parser <1.20.3 is vulnerable to denial of service when url encoding is enabled. A malicious actor using a specially crafted payload could flood the server with a large number of requests, resulting in denial of service. This issue is patched in 1.20.3.",
        "severity": "HIGH",
        "type": "Denial of Service",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      }
    ]
  },
  "cookie-parser_1.4.7": {
    "timestamp": 1763837098.520417,
    "data": []
  },
  "cors_2.8.5": {
    "timestamp": 1763837099.975252,
    "data": [
      {
        "cve": "CVE-2006-3917",
        "description": "PHP remote file inclusion vulnerability in inc/gabarits.php in R. Corson PHP Forge 3 beta 2 and earlier allows remote attackers to execute arbitrary PHP code via a URL in the cfg_racine parameter.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2013-1639",
        "description": "Opera before 12.13 does not send CORS preflight requests in all required cases, which allows remote attackers to bypass a CSRF protection mechanism via a crafted web site that triggers a CORS request.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 6.8
      },
      {
        "cve": "CVE-2013-6666",
        "description": "The PepperFlashRendererHost::OnNavigate function in renderer/pepper/pepper_flash_renderer_host.cc in Google Chrome before 33.0.1750.146 does not verify that all headers are Cross-Origin Resource Sharing (CORS) simple headers before proceeding with a PPB_Flash.Navigate operation, which might allow remote attackers to bypass intended CORS restrictions via an inappropriate header.",
        "severity": "MEDIUM",
        "type": "Remote Code Execution",
        "remediation": "Update to a patched version",
        "cvss_score": 5.8
      },
      {
        "cve": "CVE-2014-6439",
        "description": "Cross-site scripting (XSS) vulnerability in the CORS functionality in Elasticsearch before 1.4.0.Beta1 allows remote attackers to inject arbitrary web script or HTML via unspecified vectors.",
        "severity": "MEDIUM",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 4.3
      },
      {
        "cve": "CVE-2014-8024",
        "description": "The API in the Guest Server in Cisco Jabber, when the HTML5 CORS feature is used, allows remote attackers to obtain sensitive information by sniffing the network during an HTTP (1) GET or (2) POST request, aka Bug ID CSCus19789.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 4.3
      },
      {
        "cve": "CVE-2014-7193",
        "description": "The Crumb plugin before 3.0.0 for Node.js does not properly restrict token access in situations where a hapi route handler has CORS enabled, which allows remote attackers to obtain sensitive information, and potentially obtain the ability to spoof requests to non-CORS routes, via a crafted web site that is visited by an application consumer.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.8
      },
      {
        "cve": "CVE-2014-8638",
        "description": "The navigator.sendBeacon implementation in Mozilla Firefox before 35.0, Firefox ESR 31.x before 31.4, Thunderbird before 31.4, and SeaMonkey before 2.32 omits the CORS Origin header, which allows remote attackers to bypass intended CORS access-control checks and conduct cross-site request forgery (CSRF) attacks via a crafted web site.",
        "severity": "MEDIUM",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 6.8
      },
      {
        "cve": "CVE-2014-9476",
        "description": "MediaWiki 1.2x before 1.22.15, 1.23.x before 1.23.8, and 1.24.x before 1.24.1 allows remote attackers to bypass CORS restrictions in $wgCrossSiteAJAXdomains via a domain that has a partial match to an allowed origin, as demonstrated by \"http://en.wikipedia.org.evilsite.example/.\"",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2015-0807",
        "description": "The navigator.sendBeacon implementation in Mozilla Firefox before 37.0, Firefox ESR 31.x before 31.6, and Thunderbird before 31.6 processes HTTP 30x status codes for redirects after a preflight request has occurred, which allows remote attackers to bypass intended CORS access-control checks and conduct cross-site request forgery (CSRF) attacks via a crafted web site, a similar issue to CVE-2014-8638.",
        "severity": "MEDIUM",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 6.8
      },
      {
        "cve": "CVE-2015-4520",
        "description": "Mozilla Firefox before 41.0 and Firefox ESR 38.x before 38.3 allow remote attackers to bypass CORS preflight protection mechanisms by leveraging (1) duplicate cache-key generation or (2) retrieval of a value from an incorrect HTTP Access-Control-* response header.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 6.4
      },
      {
        "cve": "CVE-2015-6762",
        "description": "The CSSFontFaceSrcValue::fetch function in core/css/CSSFontFaceSrcValue.cpp in the Cascading Style Sheets (CSS) implementation in Blink, as used in Google Chrome before 46.0.2490.71, does not use the CORS cross-origin request algorithm when a font's URL appears to be a same-origin URL, which allows remote web servers to bypass the Same Origin Policy via a redirect.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2015-7184",
        "description": "The fetch API implementation in Mozilla Firefox before 41.0.2 does not restrict access to the HTTP response body in certain situations where user credentials are supplied but the CORS cross-origin request algorithm is improperly followed, which allows remote attackers to bypass the Same Origin Policy via a crafted web site.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 6.8
      },
      {
        "cve": "CVE-2015-7193",
        "description": "Mozilla Firefox before 42.0 and Firefox ESR 38.x before 38.4 improperly follow the CORS cross-origin request algorithm for the POST method in situations involving an unspecified Content-Type header manipulation, which allows remote attackers to bypass the Same Origin Policy by leveraging the lack of a preflight-request step.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2016-5192",
        "description": "Blink in Google Chrome prior to 54.0.2840.59 for Windows missed a CORS check on redirect in TextTrackLoader, which allowed a remote attacker to bypass cross-origin restrictions via crafted HTML pages.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 6.5
      },
      {
        "cve": "CVE-2017-11173",
        "description": "Missing anchor in generated regex for rack-cors before 0.4.1 allows a malicious third-party site to perform CORS requests. If the configuration were intended to allow only the trusted example.com domain name and not the malicious example.net domain name, then example.com.example.net (as well as example.com-example.net) would be inadvertently allowed.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 8.8
      },
      {
        "cve": "CVE-2017-7674",
        "description": "The CORS Filter in Apache Tomcat 9.0.0.M1 to 9.0.0.M21, 8.5.0 to 8.5.15, 8.0.0.RC1 to 8.0.44 and 7.0.41 to 7.0.78 did not add an HTTP Vary header indicating that the response varies depending on Origin. This permitted client and server side cache poisoning in some circumstances.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 4.3
      },
      {
        "cve": "CVE-2017-7561",
        "description": "Red Hat JBoss EAP version 3.0.7 through before 4.0.0.Beta1 is vulnerable to a server-side cache poisoning or CORS requests in the JAX-RS component resulting in a moderate impact.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2015-5184",
        "description": "Console: CORS headers set to allow all in Red Hat AMQ.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2015-2186",
        "description": "The Ansible edxapp role in the Configuration Repo in edX allows remote websites to spoof edX accounts by leveraging use of the string literal \"False\" instead of a boolean False for the CORS_ORIGIN_ALLOW_ALL setting. Note: this vulnerability was fixed on 2015-03-06, but the version number was not changed.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2018-8014",
        "description": "The defaults settings for the CORS filter provided in Apache Tomcat 9.0.0.M1 to 9.0.8, 8.5.0 to 8.5.31, 8.0.0.RC1 to 8.0.52, 7.0.41 to 7.0.88 are insecure and enable 'supportsCredentials' for all origins. It is expected that users of the CORS filter will have configured it appropriately for their environment rather than using it in the default configuration. Therefore, it is expected that most users will not be impacted by this issue.",
        "severity": "CRITICAL",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 9.8
      }
    ]
  },
  "crypto-js_4.2.0": {
    "timestamp": 1763837101.5798206,
    "data": [
      {
        "cve": "CVE-2020-36732",
        "description": "The crypto-js package before 3.2.1 for Node.js generates random numbers by concatenating the string \"0.\" with an integer, which makes the output more predictable than necessary.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.3
      },
      {
        "cve": "CVE-2023-46233",
        "description": "crypto-js is a JavaScript library of crypto standards. Prior to version 4.2.0, crypto-js PBKDF2 is 1,000 times weaker than originally specified in 1993, and at least 1,300,000 times weaker than current industry standard. This is because it both defaults to SHA1, a cryptographic hash algorithm considered insecure since at least 2005, and defaults to one single iteration, a 'strength' or 'difficulty' value specified at 1,000 when specified in 1993. PBKDF2 relies on iteration count as a countermeasure to preimage and collision attacks. If used to protect passwords, the impact is high. If used to generate signatures, the impact is high. Version 4.2.0 contains a patch for this issue. As a workaround, configure crypto-js to use SHA256 with at least 250,000 iterations.",
        "severity": "CRITICAL",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 9.1
      }
    ]
  },
  "express_5.1.0": {
    "timestamp": 1763837103.0536659,
    "data": [
      {
        "cve": "CVE-1999-0967",
        "description": "Buffer overflow in the HTML library used by Internet Explorer, Outlook Express, and Windows Explorer via the res: local resource protocol.",
        "severity": "HIGH",
        "type": "Buffer Overflow",
        "remediation": "Update to a patched version",
        "cvss_score": 10.0
      },
      {
        "cve": "CVE-1999-1033",
        "description": "Microsoft Outlook Express before 4.72.3612.1700 allows a malicious user to send a message that contains a .., which can inadvertently cause Outlook to re-enter POP3 command mode and cause the POP3 session to hang.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-1999-1016",
        "description": "Microsoft HTML control as used in (1) Internet Explorer 5.0, (2) FrontPage Express, (3) Outlook Express 5, and (4) Eudora, and possibly others, allows remote malicious web site or HTML emails to cause a denial of service (100% CPU consumption) via large HTML form fields such as text inputs in a table cell.",
        "severity": "MEDIUM",
        "type": "Denial of Service",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-1999-1009",
        "description": "The Disney Go Express Search allows remote attackers to access and modify search information for users by connecting to an HTTP server on the user's system.",
        "severity": "LOW",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 2.6
      },
      {
        "cve": "CVE-2000-0036",
        "description": "Outlook Express 5 for Macintosh downloads attachments to HTML mail without prompting the user, aka the \"HTML Mail Attachment\" vulnerability.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-1999-0455",
        "description": "The Expression Evaluator sample application in ColdFusion allows remote attackers to read or delete files on the server via exprcalc.cfm, which does not restrict access to the server properly.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-1999-0477",
        "description": "The Expression Evaluator in the ColdFusion Application Server allows a remote attacker to upload files to the server via openfile.cfm, which does not restrict access to the server properly.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2000-0115",
        "description": "IIS allows local users to cause a denial of service via invalid regular expressions in a Visual Basic script in an ASP page.",
        "severity": "MEDIUM",
        "type": "Denial of Service",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2000-0105",
        "description": "Outlook Express 5.01 and Internet Explorer 5.01 allow remote attackers to view a user's email messages via a script that accesses a variable that references subsequent email messages that are read by the client.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2000-0415",
        "description": "Buffer overflow in Outlook Express 4.x allows attackers to cause a denial of service via a mail or news message that has a .jpg or .bmp attachment with a long file name.",
        "severity": "MEDIUM",
        "type": "Buffer Overflow",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2000-0451",
        "description": "The Intel express 8100 ISDN router allows remote attackers to cause a denial of service via oversized or fragmented ICMP packets.",
        "severity": "MEDIUM",
        "type": "Denial of Service",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2000-0524",
        "description": "Microsoft Outlook and Outlook Express allow remote attackers to cause a denial of service by sending email messages with blank fields such as BCC, Reply-To, Return-Path, or From.",
        "severity": "MEDIUM",
        "type": "Denial of Service",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2000-0567",
        "description": "Buffer overflow in Microsoft Outlook and Outlook Express allows remote attackers to execute arbitrary commands via a long Date field in an email header, aka the \"Malformed E-mail Header\" vulnerability.",
        "severity": "MEDIUM",
        "type": "Buffer Overflow",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2000-0621",
        "description": "Microsoft Outlook 98 and 2000, and Outlook Express 4.0x and 5.0x, allow remote attackers to read files on the client's system via a malformed HTML message that stores files outside of the cache, aka the \"Cache Bypass\" vulnerability.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2000-0653",
        "description": "Microsoft Outlook Express allows remote attackers to monitor a user's email by creating a persistent browser link to the Outlook Express windows, aka the \"Persistent Mail-Browser Link\" vulnerability.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2000-0764",
        "description": "Intel Express 500 series switches allow a remote attacker to cause a denial of service via a malformed IP packet.",
        "severity": "MEDIUM",
        "type": "Denial of Service",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2000-0882",
        "description": "Intel Express 500 series switches allow a remote attacker to cause a denial of service via a malformed ICMP packet, which causes the CPU to crash.",
        "severity": "MEDIUM",
        "type": "Denial of Service",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2000-0913",
        "description": "mod_rewrite in Apache 1.3.12 and earlier allows remote attackers to read arbitrary files if a RewriteRule directive is expanded to include a filename whose name contains a regular expression.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2000-1238",
        "description": "BEA Systems WebLogic Express and WebLogic Server 5.1 SP1-SP6 allows remote attackers to bypass access controls for restricted JSP or servlet pages via a URL with multiple / (forward slash) characters before the restricted pages.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2001-1325",
        "description": "Internet Explorer 5.0 and 5.5, and Outlook Express 5.0 and 5.5, allow remote attackers to execute scripts when Active Scripting is disabled by including the scripts in XML stylesheets (XSL) that are referenced using an IFRAME tag, possibly due to a vulnerability in Windows Scripting Host (WSH).",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      }
    ]
  },
  "express-session_1.18.2": {
    "timestamp": 1763837104.402156,
    "data": [
      {
        "cve": "CVE-2021-43802",
        "description": "Etherpad is a real-time collaborative editor. In versions prior to 1.8.16, an attacker can craft an `*.etherpad` file that, when imported, might allow the attacker to gain admin privileges for the Etherpad instance. This, in turn, can be used to install a malicious Etherpad plugin that can execute arbitrary code (including system commands). To gain privileges, the attacker must be able to trigger deletion of `express-session` state or wait for old `express-session` state to be cleaned up. Core Etherpad does not delete any `express-session` state, so the only known attacks require either a plugin that can delete session state or a custom cleanup process (such as a cron job that deletes old `sessionstorage:*` records). The problem has been fixed in version 1.8.16. If users cannot upgrade to 1.8.16 or install patches manually, several workarounds are available. Users may configure their reverse proxies to reject requests to `/p/*/import`, which will block all imports, not just `*.etherpad` imports; limit all users to read-only access; and/or prevent the reuse of `express_sid` cookie values that refer to deleted express-session state. More detailed information and general mitigation strategies may be found in the GitHub Security Advisory.",
        "severity": "CRITICAL",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 9.9
      },
      {
        "cve": "CVE-2025-11609",
        "description": "A flaw has been found in code-projects Hospital Management System 1.0. Affected is the function session of the component express-session. This manipulation of the argument secret with the input secret causes use of hard-coded cryptographic key\r . The attack can be initiated remotely. The attack is considered to have high complexity. The exploitability is told to be difficult. The exploit has been published and may be used.",
        "severity": "LOW",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 3.7
      }
    ]
  },
  "helmet_8.1.0": {
    "timestamp": 1763837105.927841,
    "data": [
      {
        "cve": "CVE-2022-46073",
        "description": "Helmet Store Showroom 1.0 is vulnerable to Cross Site Scripting (XSS).",
        "severity": "MEDIUM",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 6.1
      },
      {
        "cve": "CVE-2022-46074",
        "description": "Helmet Store Showroom 1.0 is vulnerable to Cross Site Request Forgery (CSRF). An unauthenticated user can add an admin account due to missing CSRF protection.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 8.8
      },
      {
        "cve": "CVE-2022-46117",
        "description": "Helmet Store Showroom Site v1.0 is vulnerable to SQL Injection via /hss/?page=view_product&id=.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46118",
        "description": "Helmet Store Showroom Site v1.0 is vulnerable to SQL Injection via /hss/?page=product_per_brand&bid=.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46119",
        "description": "Helmet Store Showroom Site v1.0 is vulnerable to SQL Injection via /hss/?page=categories&c=.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46120",
        "description": "Helmet Store Showroom Site v1.0 is vulnerable to SQL Injection via /hss/admin/?page=products/view_product&id=.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46121",
        "description": "Helmet Store Showroom Site v1.0 is vulnerable to SQL Injection via /hss/admin/?page=products/manage_product&id=.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46122",
        "description": "Helmet Store Showroom Site v1.0 is vulnerable to SQL Injection via /hss/admin/categories/view_category.php?id=.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46123",
        "description": "Helmet Store Showroom Site v1.0 is vulnerable to SQL Injection via /hss/admin/categories/manage_category.php?id=.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46124",
        "description": "Helmet Store Showroom Site v1.0 is vulnerable to SQL Injection via /hss/admin/?page=user/manage_user&id=.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46125",
        "description": "Helmet Store Showroom Site v1.0 is vulnerable to SQL Injection via /hss/admin/?page=client/manage_client&id=.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46126",
        "description": "Helmet Store Showroom Site v1.0 is vulnerable to SQL Injection via /hss/admin/brands/manage_brand.php?id=.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46127",
        "description": "Helmet Store Showroom Site v1.0 is vulnerable to SQL Injection via /hss/classes/Master.php?f=delete_product.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46071",
        "description": "There is SQL Injection vulnerability at Helmet Store Showroom v1.0 Login Page. This vulnerability can be exploited to bypass admin access.",
        "severity": "CRITICAL",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 9.8
      },
      {
        "cve": "CVE-2022-46072",
        "description": "Helmet Store Showroom v1.0 vulnerable to unauthenticated SQL Injection.",
        "severity": "CRITICAL",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 9.8
      },
      {
        "cve": "CVE-2022-46472",
        "description": "Helmet Store Showroom Site v1.0 was discovered to contain a SQL injection vulnerability via the id parameter at /hss/classes/Users.php?f=delete.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46946",
        "description": "Helmet Store Showroom Site v1.0 was discovered to contain a SQL injection vulnerability via the id parameter at /classes/Master.php?f=delete_brand.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46947",
        "description": "Helmet Store Showroom Site v1.0 was discovered to contain a SQL injection vulnerability via the id parameter at /classes/Master.php?f=delete_category.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2022-46949",
        "description": "Helmet Store Showroom Site v1.0 was discovered to contain a SQL injection vulnerability via the id parameter at /classes/Master.php?f=delete_helmet.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2025-54128",
        "description": "HAX CMS NodeJs allows users to manage their microsite universe with a NodeJs backend. In versions 11.0.7 and below, the NodeJS version of HAX CMS has a disabled Content Security Policy (CSP). This configuration is insecure for a production application because it does not protect against cross-site-scripting attacks. The contentSecurityPolicy value is explicitly disabled in the application's Helmet configuration in app.js. This is fixed in version 11.0.8.",
        "severity": "MEDIUM",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 6.1
      }
    ]
  },
  "jsonwebtoken_9.0.2": {
    "timestamp": 1763837107.3847466,
    "data": [
      {
        "cve": "CVE-2017-18239",
        "description": "A time-sensitive equality check on the JWT signature in the JsonWebToken.validate method in main/scala/authentikat/jwt/JsonWebToken.scala in authentikat-jwt (aka com.jason-goodwin/authentikat-jwt) version 0.4.5 and earlier allows the supplier of a JWT token to guess bit after bit of the signature by repeating validation requests.",
        "severity": "CRITICAL",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 9.8
      },
      {
        "cve": "CVE-2015-9235",
        "description": "In jsonwebtoken node module before 4.2.2 it is possible for an attacker to bypass verification when a token digitally signed with an asymmetric key (RS/ES family) of algorithms but instead the attacker send a token digitally signed with a symmetric algorithm (HS* family).",
        "severity": "CRITICAL",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 9.8
      },
      {
        "cve": "CVE-2022-23541",
        "description": "jsonwebtoken is an implementation of JSON Web Tokens. Versions `<= 8.5.1` of `jsonwebtoken` library can be misconfigured so that passing a poorly implemented key retrieval function referring to the `secretOrPublicKey` argument from the readme link will result in incorrect verification of tokens. There is a possibility of using a different algorithm and key combination in verification, other than the one that was used to sign the tokens. Specifically, tokens signed with an asymmetric public key could be verified with a symmetric HS256 algorithm. This can lead to successful validation of  forged tokens. If your application is supporting usage of both symmetric key and asymmetric key in jwt.verify() implementation with the same key retrieval function. This issue has been patched, please update to version 9.0.0.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2024-29945",
        "description": "In Splunk Enterprise versions below 9.2.1, 9.1.4, and 9.0.9, the software potentially exposes authentication tokens during the token validation process. This exposure happens when either Splunk Enterprise runs in debug mode or the JsonWebToken component has been configured to log its activity at the DEBUG logging level.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      }
    ]
  },
  "morgan_1.10.1": {
    "timestamp": 1763837108.8130112,
    "data": [
      {
        "cve": "CVE-2019-5413",
        "description": "An attacker can use the format parameter to inject arbitrary commands in the npm package morgan < 1.9.1.",
        "severity": "CRITICAL",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 9.8
      },
      {
        "cve": "CVE-2020-13656",
        "description": "In Morgan Stanley Hobbes through 2020-05-21, the array implementation lacks bounds checking, allowing exploitation of an out-of-bounds (OOB) read/write vulnerability that leads to both local and remote code (via RPC) execution.",
        "severity": "CRITICAL",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 9.8
      },
      {
        "cve": "CVE-2022-25921",
        "description": "All versions of package morgan-json are vulnerable to Arbitrary Code Execution due to missing sanitization of input passed to the Function constructor.",
        "severity": "HIGH",
        "type": "Remote Code Execution",
        "remediation": "Update to a patched version",
        "cvss_score": 8.1
      },
      {
        "cve": "CVE-2025-23917",
        "description": "Missing Authorization vulnerability in Chandrika Guntur, Morgan Kay Chamber Dashboard Business Directory allows Exploiting Incorrectly Configured Access Control Security Levels.This issue affects Chamber Dashboard Business Directory: from n/a through 3.3.8.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.4
      },
      {
        "cve": "CVE-2025-30532",
        "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in MorganF Weather Layer allows Stored XSS. This issue affects Weather Layer: from n/a through 4.2.1.",
        "severity": "MEDIUM",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 5.9
      },
      {
        "cve": "CVE-2025-32162",
        "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in Morgan Kay Chamber Dashboard Business Directory allows DOM-Based XSS. This issue affects Chamber Dashboard Business Directory: from n/a through 3.3.11.",
        "severity": "MEDIUM",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 6.5
      },
      {
        "cve": "CVE-2025-58671",
        "description": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') vulnerability in morganrichards Auction Feed allows Stored XSS. This issue affects Auction Feed: from n/a through 1.1.3.",
        "severity": "HIGH",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 7.1
      }
    ]
  },
  "node-schedule_2.1.1": {
    "timestamp": 1763837110.1776242,
    "data": []
  },
  "nodemon_3.1.11": {
    "timestamp": 1763837111.462215,
    "data": []
  },
  "paginate-info_1.0.4": {
    "timestamp": 1763837112.97646,
    "data": []
  },
  "passport_0.7.0": {
    "timestamp": 1763837114.3729541,
    "data": [
      {
        "cve": "CVE-2016-7191",
        "description": "The Microsoft Azure Active Directory Passport (aka Passport-Azure-AD) library 1.x before 1.4.6 and 2.x before 2.0.1 for Node.js does not recognize the validateIssuer setting, which allows remote attackers to bypass authentication via a crafted token.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 8.1
      },
      {
        "cve": "CVE-2017-16897",
        "description": "A vulnerability has been discovered in the Auth0 passport-wsfed-saml2 library affecting versions < 3.0.5. This vulnerability allows an attacker to impersonate another user and potentially elevate their privileges if the SAML identity provider does not sign the full SAML response (e.g., only signs the assertion within the response).",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 8.1
      },
      {
        "cve": "CVE-2018-10813",
        "description": "In Dedos-web 1.0, the cookie and session secrets used in the Express.js application have hardcoded values that are visible in the source code published on GitHub. An attacker can edit the contents of the session cookie and re-sign it using the hardcoded secret. Due to the use of Passport.js, this could lead to privilege escalation.",
        "severity": "HIGH",
        "type": "Denial of Service",
        "remediation": "Update to a patched version",
        "cvss_score": 7.3
      },
      {
        "cve": "CVE-2018-10966",
        "description": "An issue was discovered in GamerPolls 0.4.6, related to config/environments/all.js and config/initializers/02_passport.js. An attacker can edit the Passport.js contents of the session cookie to contain the ID number of the account they wish to take over, and re-sign it using the hard coded secret.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.3
      },
      {
        "cve": "CVE-2019-7632",
        "description": "LifeSize Team, Room, Passport, and Networker 220 devices allow Authenticated Remote OS Command Injection, as demonstrated by shell metacharacters in the support/mtusize.php mtu_size parameter. The lifesize default password for the cli account may sometimes be used for authentication.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 8.8
      },
      {
        "cve": "CVE-2018-17499",
        "description": "Envoy Passport for Android and Envoy Passport for iPhone could allow a local attacker to obtain sensitive information, caused by the storing of unencrypted data in logs. An attacker could exploit this vulnerability to obtain two API keys, a token and other sensitive information.",
        "severity": "LOW",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 2.9
      },
      {
        "cve": "CVE-2018-17500",
        "description": "Envoy Passport for Android and Envoy Passport for iPhone could allow a local attacker to obtain sensitive information, caused by the storing of hardcoded OAuth Creds in plaintext. An attacker could exploit this vulnerability to obtain sensitive information.",
        "severity": "LOW",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 2.9
      },
      {
        "cve": "CVE-2019-13483",
        "description": "Auth0 Passport-SharePoint before 0.4.0 does not validate the JWT signature of an Access Token before processing. This allows attackers to forge tokens and bypass authentication and authorization mechanisms.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.3
      },
      {
        "cve": "CVE-2021-39171",
        "description": "Passport-SAML is a SAML 2.0 authentication provider for Passport, the Node.js authentication library. Prior to version 3.1.0, a malicious SAML payload can require transforms that consume significant system resources to process, thereby resulting in reduced or denied service. This would be an effective way to perform a denial-of-service attack. This has been resolved in version 3.1.0. The resolution is to limit the number of allowable transforms to 2.",
        "severity": "MEDIUM",
        "type": "Remote Code Execution",
        "remediation": "Update to a patched version",
        "cvss_score": 5.3
      },
      {
        "cve": "CVE-2021-41580",
        "description": "The passport-oauth2 package before 1.6.1 for Node.js mishandles the error condition of failure to obtain an access token. This is exploitable in certain use cases where an OAuth identity provider uses an HTTP 200 status code for authentication-failure error reports, and an application grants authorization upon simply receiving the access token (i.e., does not try to use the token). NOTE: the passport-oauth2 vendor does not consider this a passport-oauth2 vulnerability",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.3
      },
      {
        "cve": "CVE-2022-26952",
        "description": "Digi Passport Firmware through 1.5.1,1 is affected by a buffer overflow in the function for building the Location header string when an unauthenticated user is redirected to the authentication page.",
        "severity": "HIGH",
        "type": "Buffer Overflow",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2022-26953",
        "description": "Digi Passport Firmware through 1.5.1,1 is affected by a buffer overflow. An attacker can supply a string in the page parameter for reboot.asp endpoint, allowing him to force an overflow when the string is concatenated to the HTML body.",
        "severity": "HIGH",
        "type": "Buffer Overflow",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2022-25896",
        "description": "This affects the package passport before 0.6.0. When a user logs in or logs out, the session is regenerated instead of being closed.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 4.8
      },
      {
        "cve": "CVE-2022-39299",
        "description": "Passport-SAML is a SAML 2.0 authentication provider for Passport, the Node.js authentication library. A remote attacker may be able to bypass SAML authentication on a website using passport-saml. A successful attack requires that the attacker is in possession of an arbitrary IDP signed XML element. Depending on the IDP used, fully unauthenticated attacks (e.g without access to a valid user) might also be feasible if generation of a signed message can be triggered. Users should upgrade to passport-saml version 3.2.2 or newer. The issue was also present in the beta releases of `node-saml` before version 4.0.0-beta.5. If you cannot upgrade, disabling SAML authentication may be done as a workaround.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.4
      },
      {
        "cve": "CVE-2022-39300",
        "description": "node SAML is a SAML 2.0 library based on the SAML implementation of passport-saml. A remote attacker may be able to bypass SAML authentication on a website using passport-saml. A successful attack requires that the attacker is in possession of an arbitrary IDP signed XML element. Depending on the IDP used, fully unauthenticated attacks (e.g without access to a valid user) might also be feasible if generation of a signed message can be triggered. Users should upgrade to node-saml version 4.0.0-beta5 or newer. Disabling SAML authentication may be done as a workaround.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.7
      },
      {
        "cve": "CVE-2022-23505",
        "description": "Passport-wsfed-saml2 is a ws-federation protocol and SAML2 tokens authentication provider for Passport. In versions prior to 4.6.3, a remote attacker may be able to bypass WSFed authentication on a website using passport-wsfed-saml2. A successful attack requires that the attacker is in possession of an arbitrary IDP signed assertion. Depending on the IDP used, fully unauthenticated attacks (e.g without access to a valid user) might also be feasible if generation of a signed message can be triggered. This issue is patched in version 4.6.3. Use of SAML2 authentication instead of WSFed is a workaround.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.3
      },
      {
        "cve": "CVE-2023-29019",
        "description": "@fastify/passport is a port of passport authentication library for the Fastify ecosystem. Applications using `@fastify/passport` in affected versions for user authentication, in combination with `@fastify/session` as the underlying session management mechanism, are vulnerable to session fixation attacks from network and same-site attackers. fastify applications rely on the `@fastify/passport` library for user authentication. The login and user validation are performed by the `authenticate` function. When executing this function, the `sessionId` is preserved between the pre-login and the authenticated session. Network and same-site attackers can hijack the victim's session by tossing a valid `sessionId` cookie in the victim's browser and waiting for the victim to log in on the website. As a solution, newer versions of `@fastify/passport` regenerate `sessionId` upon login, preventing the attacker-controlled pre-session cookie from being upgraded to an authenticated session. Users are advised to upgrade. There are no known workarounds for this vulnerability.\n",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 8.1
      },
      {
        "cve": "CVE-2023-29020",
        "description": "@fastify/passport is a port of passport authentication library for the Fastify ecosystem. The CSRF (Cross-Site Request Forger) protection enforced by the `@fastify/csrf-protection` library, when combined with `@fastify/passport` in affected versions, can be bypassed by network and same-site attackers. `fastify/csrf-protection` implements the synchronizer token pattern (using plugins `@fastify/session` and `@fastify/secure-session`) by storing a random value used for CSRF token generation in the `_csrf` attribute of a user's session. The `@fastify/passport` library does not clear the session object upon authentication, preserving the `_csrf` attribute between pre-login and authenticated sessions. Consequently, CSRF tokens generated before authentication are still valid. Network and same-site attackers can thus obtain a CSRF token for their pre-session, fixate that pre-session in the victim's browser via cookie tossing, and then perform a CSRF attack after the victim authenticates. As a solution, newer versions of `@fastify/passport` include the configuration options: `clearSessionOnLogin (default: true)` and `clearSessionIgnoreFields (default: ['passport', 'session'])` to clear all the session attributes by default, preserving those explicitly defined in `clearSessionIgnoreFields`.",
        "severity": "MEDIUM",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 6.5
      },
      {
        "cve": "CVE-2023-47131",
        "description": "The N-able PassPortal extension before 3.29.2 for Chrome inserts sensitive information into a log file.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2023-42427",
        "description": "Cross-site scripting vulnerability exists in UNIVERSAL PASSPORT RX versions 1.0.0 to 1.0.7, which may allow a remote authenticated attacker to execute an arbitrary script on the web browser of the user who is using the product.",
        "severity": "MEDIUM",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 6.5
      }
    ]
  },
  "qs_6.14.0": {
    "timestamp": 1763837115.729199,
    "data": [
      {
        "cve": "CVE-2001-1477",
        "description": "The Domain gateway in BEA Tuxedo 7.1 does not perform authorization checks for imported services and qspaces on remote domains, even when an ACL exists, which allows users to access services in a remote domain.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 4.6
      },
      {
        "cve": "CVE-2001-0891",
        "description": "Format string vulnerability in NQS daemon (nqsdaemon) in NQE 3.3.0.16 for CRAY UNICOS and SGI IRIX allows a local user to gain root privileges by using qsub to submit a batch job whose name contains formatting characters.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.2
      },
      {
        "cve": "CVE-2005-1240",
        "description": "Directory traversal vulnerability in the third party tool from Castlehill, as used to secure the iSeries AS/400 FTP server, allows remote attackers to access arbitrary files, including those from qsys.lib, via \"..\" sequences in a GET request.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2005-1241",
        "description": "Directory traversal vulnerability in the third party tool from Powertech, as used to secure the iSeries AS/400 FTP server, allows remote attackers to access arbitrary files, including those from qsys.lib, via \"..\" sequences in a GET request.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2005-1244",
        "description": "Directory traversal vulnerability in the third party tool from NetIQ, as used to secure the iSeries AS/400 FTP server, allows remote attackers to access arbitrary files, including those from qsys.lib, via \"..\" sequences in a GET request.  NOTE: the vendor has disputed this issue, saying that \"neither NetIQ Security Manager nor our iSeries Security Solutions are vulnerable.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2005-1025",
        "description": "The FTP server in AS/400 4.3, when running in IFS mode, allows remote attackers to obtain sensitive information via a symlink attack using RCMD and the ADDLNK utility, as demonstrated using the QSYS.LIB library.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2005-1238",
        "description": "By design, the built-in FTP server for iSeries AS/400 systems does not support a restricted document root, which allows attackers to read or write arbitrary files, including sensitive QSYS databases, via a full pathname in a GET or PUT request.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2005-1239",
        "description": "Directory traversal vulnerability in the third party tool from Raz-Lee, as used to secure the iSeries AS/400 FTP server, allows remote attackers to access arbitrary files, including those from qsys.lib, via \"..\" sequences in a GET request.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2005-1242",
        "description": "Directory traversal vulnerability in the third party tool from Bsafe, as used to secure the iSeries AS/400 FTP server, allows remote attackers to access arbitrary files, including those from qsys.lib, via \"..\" sequences in a GET request.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2005-1243",
        "description": "Directory traversal vulnerability in the third party tool from SafeStone, as used to secure the iSeries AS/400 FTP server, allows remote attackers to access arbitrary files, including those from qsys.lib, via \"..\" sequences in a GET request.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 5.0
      },
      {
        "cve": "CVE-2007-1587",
        "description": "templates/config/mail.tpl in Tim Soderstrom StatsDawg 0.92 allows remote attackers to execute arbitrary programs by specifying the program name in the qshapeLocation parameter.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 10.0
      },
      {
        "cve": "CVE-2007-3388",
        "description": "Multiple format string vulnerabilities in (1) qtextedit.cpp, (2) qdatatable.cpp, (3) qsqldatabase.cpp, (4) qsqlindex.cpp, (5) qsqlrecord.cpp, (6) qglobal.cpp, and (7) qsvgdevice.cpp in QTextEdit in Trolltech Qt 3 before 3.3.8 20070727 allow remote attackers to execute arbitrary code via format string specifiers in text used to compose an error message.",
        "severity": "MEDIUM",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 6.8
      },
      {
        "cve": "CVE-2007-4722",
        "description": "Multiple stack-based buffer overflows in the Quantum Streaming Internet Explorer Player ActiveX control in qsp2ie07051001.dll 1.0.0.1 in Move Media Player allow remote attackers to execute arbitrary code via a long string to the (1) Play and (2) Buzzer methods.",
        "severity": "MEDIUM",
        "type": "Buffer Overflow",
        "remediation": "Update to a patched version",
        "cvss_score": 6.8
      },
      {
        "cve": "CVE-2007-5965",
        "description": "QSslSocket in Trolltech Qt 4.3.0 through 4.3.2 does not properly verify SSL certificates, which might make it easier for remote attackers to trick a user into accepting an invalid server certificate for a spoofed service, or trick a service into accepting an invalid client certificate for a user.",
        "severity": "MEDIUM",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 4.3
      },
      {
        "cve": "CVE-2008-1044",
        "description": "Stack-based buffer overflow in the Quantum Streaming Player (Quantum Streaming IE Player) ActiveX control (aka QSP2IE.QSP2IE) in qsp2ie07076007.dll 7.7.6.7 and qsp2ie07074039.dll 7.7.4.39 in Move Media Player allows remote attackers to execute arbitrary code via a long argument to the UploadLogs method, a different vector than CVE-2007-4722.  NOTE: some of these details are obtained from third party information.",
        "severity": "HIGH",
        "type": "Buffer Overflow",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2008-3580",
        "description": "Multiple SQL injection vulnerabilities in Qsoft K-Links allow remote attackers to execute arbitrary SQL commands via (1) the id parameter to visit.php, or the PATH_INFO to the default URI under (2) report/, (3) addreview/, or (4) refer/.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2008-3581",
        "description": "Cross-site scripting (XSS) vulnerability in index.php in Qsoft K-Links allows remote attackers to inject arbitrary web script or HTML via the login_message parameter in a login action.",
        "severity": "MEDIUM",
        "type": "Cross-Site Scripting",
        "remediation": "Update to a patched version",
        "cvss_score": 4.3
      },
      {
        "cve": "CVE-2009-1134",
        "description": "Excel in 2007 Microsoft Office System SP1 and SP2; Microsoft Office Excel Viewer; and Microsoft Office Compatibility Pack for Word, Excel, and PowerPoint 2007 File Formats SP1 and SP2 allow remote attackers to execute arbitrary code via a BIFF file with a malformed Qsir (0x806) record object, aka \"Record Pointer Corruption Vulnerability.\"",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 9.3
      },
      {
        "cve": "CVE-2008-7064",
        "description": "Directory traversal vulnerability in the get_lang function in global.php in Quicksilver Forums 1.4.2 and earlier, as used in QSF Portal before 1.4.5, when running on Windows, allows remote attackers to include and execute arbitrary local files via a \"\\\" (backslash) in the lang parameter to index.php, which bypasses a protection mechanism that only checks for \"/\" (forward slash), as demonstrated by uploading and including PHP code in an avatar file.",
        "severity": "HIGH",
        "type": "Vulnerability",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      },
      {
        "cve": "CVE-2008-7097",
        "description": "Multiple SQL injection vulnerabilities in Qsoft K-Rate Premium allow remote attackers to execute arbitrary SQL commands via (1) the $id variable in admin/includes/dele_cpac.php, (2) $ord[order_id] variable in payments/payment_received.php, (3) $id variable in includes/functions.php, and (4) unspecified variables in modules/chat.php, as demonstrated via the (a) show parameter in an online action to index.php; (b) PATH_INTO to the room/ handler; (c) image and (d) id parameters in a vote action to index.php; (e) PATH_INFO to the blog/ handler; and (f) id parameter in a blog_edit action to index.php.",
        "severity": "HIGH",
        "type": "SQL Injection",
        "remediation": "Update to a patched version",
        "cvss_score": 7.5
      }
    ]
  },
  "rand-token_1.0.1": {
    "timestamp": 1763837117.167476,
    "data": []
  },
  "uuid-validate_0.0.3": {
    "timestamp": 1763837118.490838,
    "data": []
  }
}